/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_constant_e.c                                    :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: kyoulee <kyoulee@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/07/11 18:30:02 by kyoulee           #+#    #+#             */
/*   Updated: 2022/08/06 07:57:46 by kyoulee          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* ************************************************************************** */
/* 
	자연로그 만드는 함수 약 20번 이상을 돌리는 것을 추천한다. 
	반복될수록 좀더 상세하게 자연로그를 찾층수 있다
	하지만 한계점이 있어 상수를 지정하여 사용하는 것을 추천한다
	#define C_E 2.71828182845904523536028747135266249
	공식 :: https://en.wikipedia.org/wiki/Natural_logarithm
*/
/* ************************************************************************** */

double	ft_constant_e(int repeat)
{
	double	e;
	double	temp;
	int		num;

	e = 1;
	temp = 1;
	num = 0;
	while (num < repeat)
	{
		e += 1.0 / temp;
		temp *= num;
		num++;
	}
	return (e - 1);
}
