/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_constant_pi.c                                   :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: kyoulee <kyoulee@student.42seoul.kr>       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/07/11 15:40:06 by kyoulee           #+#    #+#             */
/*   Updated: 2022/07/11 15:40:09 by kyoulee          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* ************************************************************************** */
/*
	파이 만드는 함수 약 만번 이상을 돌리는 것을 추천한다. 
	반복될수록 좀더 상세하게 파이를 찾층수 있다
	하지만 한계점이 있어 상수를 지정하여 사용하는 것을 추천한다
	#define C_PI 3.14159265358979323846264338327950288
	공식 :: https://en.wikipedia.org/wiki/Leibniz_formula_for_π
*/
/* ************************************************************************** */

double	ft_constant_pi(int repeat)
{
	double	pi;
	double	temp;
	double	p;
	int		num;

	pi = 1;
	temp = 1;
	p = -1;
	num = 0;
	while (num < repeat)
	{
		p *= -1;
		pi += p * 1.0 / temp;
		temp += 2;
		num++;
	}
	return (4 * (pi - 1));
}
